tap "d12frosted/emacs-plus"
tap "homebrew/command-not-found"
brew "atuin"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-credential-oauth"
brew "git-lfs"
brew "gnupg"
brew "hub"
brew "neovim"
brew "node"
brew "onefetch"
brew "pinentry-mac"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "topgrade"
brew "urlscan"
brew "wget"
brew "yazi"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@30"
cask "1password"
cask "anki"
cask "balenaetcher"
cask "brave-browser"
cask "calibre"
cask "discord"
cask "ghostty"
cask "iina"
cask "jordanbaird-ice"
cask "linearmouse"
cask "localsend"
cask "mos"
cask "mullvad-browser"
cask "notion"
cask "notion-calendar"
cask "numi"
cask "obsidian"
cask "ollama"
cask "onyx"
cask "orbstack"
cask "powershell"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "syncthing"
cask "tailscale"
cask "tor-browser"
cask "visual-studio-code"
cask "wezterm@nightly"
cask "zed"
cask "zen"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
