brew "bat"
brew "btop"
brew "curl"
brew "evil-helix"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git-credential-oauth"
brew "gitui"
brew "neovim"
brew "node"
brew "ripgrep"
brew "starship"
brew "tailwindcss"
brew "tmux"
brew "uutils-coreutils"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
